Revit 2027 API
DirectShape.IsValidGeometry Method
 Validates geometry to be stored in a DirectShape. Suitable geometry validation is performed. Additionally, the geometry must make sense as a shape representation for the category assigned to this DirectShape object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsValidGeometry(
	Solid Geom
)
Public Function IsValidGeometry (
	Geom As Solid
) As Boolean
public:
bool IsValidGeometry(
	Solid^ Geom
)
member IsValidGeometry :
        Geom : Solid -> bool
Parameters
Geom Solid
 GeometryObject to be validated.
Return Value
Boolean
 True if the supplied GeometryObject passes the validation criteria.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
DirectShape Class
Autodesk.Revit.DB Namespace